In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('banks.csv', sep = ';')

In [3]:
df

     Name  Platezh        Data Bank
0    Ivan     1000  07.06.2015    A
1    Anna     2000  08.06.2015    B
2    Alex     3000  09.06.2015    C
3    Egor     4000  10.06.2015    A
4   Vadim     5000  11.06.2015    B
5  Andrey     6000  12.06.2015    C
6    Oleg     7000  13.06.2015    A
7   Anton     8000  14.06.2015    A
8   Pavel     9000  09.06.2015    B
9    Mira     2000  12.06.2015    C

In [4]:
#вывод первых элементов таблицы
df.head()

    Name  Platezh        Data Bank
0   Ivan     1000  07.06.2015    A
1   Anna     2000  08.06.2015    B
2   Alex     3000  09.06.2015    C
3   Egor     4000  10.06.2015    A
4  Vadim     5000  11.06.2015    B

In [5]:
#Вывод последних элементов 
df.tail()

     Name  Platezh        Data Bank
5  Andrey     6000  12.06.2015    C
6    Oleg     7000  13.06.2015    A
7   Anton     8000  14.06.2015    A
8   Pavel     9000  09.06.2015    B
9    Mira     2000  12.06.2015    C

In [6]:
#Вывод кол-ва строк и колонок
df.shape

(10, 4)

In [7]:
#Вывод имени колонок
df.columns

Index(['Name', 'Platezh', 'Data', 'Bank'], dtype='object')

In [8]:
#Какая-то статистика
df.describe()

           Platezh
count    10.000000
mean   4700.000000
std    2750.757471
min    1000.000000
25%    2250.000000
50%    4500.000000
75%    6750.000000
max    9000.000000

In [9]:
#Переименовать колонки
df1 = df.rename(columns= {'Data': "Day", 'Platezh': 'Trunk'})

In [10]:
df1

     Name  Trunk         Day Bank
0    Ivan   1000  07.06.2015    A
1    Anna   2000  08.06.2015    B
2    Alex   3000  09.06.2015    C
3    Egor   4000  10.06.2015    A
4   Vadim   5000  11.06.2015    B
5  Andrey   6000  12.06.2015    C
6    Oleg   7000  13.06.2015    A
7   Anton   8000  14.06.2015    A
8   Pavel   9000  09.06.2015    B
9    Mira   2000  12.06.2015    C

In [11]:
#Вывод одной колонки
df['Name']

0      Ivan
1      Anna
2      Alex
3      Egor
4     Vadim
5    Andrey
6      Oleg
7     Anton
8     Pavel
9      Mira
Name: Name, dtype: object

In [12]:
#Вывод нескольких колонок
df[['Name', 'Data']].head()

    Name        Data
0   Ivan  07.06.2015
1   Anna  08.06.2015
2   Alex  09.06.2015
3   Egor  10.06.2015
4  Vadim  11.06.2015

In [13]:
df.Data.head()

0    07.06.2015
1    08.06.2015
2    09.06.2015
3    10.06.2015
4    11.06.2015
Name: Data, dtype: object

In [14]:
df.dtypes

Name       object
Platezh     int64
Data       object
Bank       object
dtype: object

In [15]:
all_money = df.Platezh.sum()

In [16]:
all_money

47000

In [17]:
#ascending для того чтобы отсортировать от самого большого к самому маленькому, as_index=False, чтобы убрать индексацию Дата. \ - для переноса строки
plat_by_data = df.groupby('Data', as_index=False) \
    .aggregate({'Platezh': 'sum'})\
    .sort_values("Platezh", ascending=False)

In [18]:
df.groupby(['Data', 'Bank'], as_index=False) \
    .aggregate({'Platezh': 'sum'})\
    .sort_values("Platezh", ascending=False)

         Data Bank  Platezh
2  09.06.2015    B     9000
6  12.06.2015    C     8000
8  14.06.2015    A     8000
7  13.06.2015    A     7000
5  11.06.2015    B     5000
4  10.06.2015    A     4000
3  09.06.2015    C     3000
1  08.06.2015    B     2000
0  07.06.2015    A     1000

In [19]:
plat_by_data.to_csv('plat_by_data.csv', index=False)

In [20]:
df.groupby('Data', as_index=False) \
    .aggregate({'Platezh': 'sum','Bank': 'count' })\
    .sort_values("Platezh", ascending=False)

         Data  Platezh  Bank
2  09.06.2015    12000     2
5  12.06.2015     8000     2
7  14.06.2015     8000     1
6  13.06.2015     7000     1
4  11.06.2015     5000     1
3  10.06.2015     4000     1
1  08.06.2015     2000     1
0  07.06.2015     1000     1

In [21]:
df.query('Platezh > 5000')

     Name  Platezh        Data Bank
5  Andrey     6000  12.06.2015    C
6    Oleg     7000  13.06.2015    A
7   Anton     8000  14.06.2015    A
8   Pavel     9000  09.06.2015    B

In [22]:
df.query("Bank == 'A'")

    Name  Platezh        Data Bank
0   Ivan     1000  07.06.2015    A
3   Egor     4000  10.06.2015    A
6   Oleg     7000  13.06.2015    A
7  Anton     8000  14.06.2015    A

In [23]:
df.Bank.unique()

array(['A', 'B', 'C'], dtype=object)

In [1]:
today = '2024-03-27'

In [2]:
file_name = 'Today_data{}.csv'

In [3]:
file_name.format(today)

'Today_data2024-03-27.csv'